benhofflich/Nordic/nRF5_SDK_17.1.0_ddde560/examples/My Projects/ble_app_uart/main.c
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            // Pairing not supported
            err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            // No system attributes have been stored.
            err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for the SoftDevice initialization.
 *
 * @details This function initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
    if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
    {
        m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
        NRF_LOG_INFO("Data len is set to 0x%X(%d)", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
    }
    NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x",
                  p_gatt->att_mtu_desired_central,
                  p_gatt->att_mtu_desired_periph);
}


/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;
    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break;

        default:
            break;
    }
}

static void drv_pdm_hand(const nrfx_pdm_evt_t *evt){

  nrfx_err_t err_code = 0;
  /*if((*evt).buffer_requested){
      if(pdm_send){
      NRF_LOG_HEXDUMP_INFO(buff1,buffer_length)
          do
          {
              err_code = ble_nus_data_send(&m_nus, buff1, &buffer_length, m_conn_handle);
              if ((err_code != NRF_ERROR_INVALID_STATE) &&
                  (err_code != NRF_ERROR_RESOURCES) &&
                  (err_code != NRF_ERROR_NOT_FOUND))
              {
                  APP_ERROR_CHECK(err_code);
              }
          } while (err_code == NRF_ERROR_RESOURCES);
          pdm_send = 0;
      }
    
    err_code = nrfx_pdm_buffer_set(p_buff1, buffer_length);
    //p_buff1 += buffer_length;
  }*/
  if((*evt).buffer_requested){
    switch(flag) {
        case 0:
            err_code = nrfx_pdm_buffer_set(p_buff1, buffer_length);
            flag = 1;
            writeFlag = 1;

            do
            {
                err_code = ble_nus_data_send(&m_nus, buff4, &buffer_length, m_conn_handle);

                //NRF_LOG_HEXDUMP_INFO(buff4, buffer_length);

                if ((err_code != NRF_ERROR_INVALID_STATE) &&
                    (err_code != NRF_ERROR_RESOURCES) &&
                    (err_code != NRF_ERROR_NOT_FOUND))
                {
                  APP_ERROR_CHECK(err_code);
                }

            } while (err_code == NRF_ERROR_RESOURCES);

            
            //error = nrfx_pdm_start();
            break;
        case 1:
            err_code = nrfx_pdm_buffer_set(p_buff2, buffer_length);
            flag = 2;
            writeFlag = 1;

            do
            {
                err_code = ble_nus_data_send(&m_nus, buff1, &buffer_length, m_conn_handle);

                //NRF_LOG_HEXDUMP_INFO(buff1, buffer_length);

                if ((err_code != NRF_ERROR_INVALID_STATE) &&
                    (err_code != NRF_ERROR_RESOURCES) &&
                    (err_code != NRF_ERROR_NOT_FOUND))
                {
                  APP_ERROR_CHECK(err_code);
                }

            } while (err_code == NRF_ERROR_RESOURCES);

            
            //error = nrfx_pdm_start();
            break;
        case 2:
            err_code = nrfx_pdm_buffer_set(p_buff3, buffer_length);
            flag = 3;
            writeFlag = 1;

            do
            {
                err_code = ble_nus_data_send(&m_nus, buff2, &buffer_length, m_conn_handle);

                //NRF_LOG_HEXDUMP_INFO(buff2, buffer_length);

                if ((err_code != NRF_ERROR_INVALID_STATE) &&
                    (err_code != NRF_ERROR_RESOURCES) &&
                    (err_code != NRF_ERROR_NOT_FOUND))
                {
                  APP_ERROR_CHECK(err_code);
                }

            } while (err_code == NRF_ERROR_RESOURCES);

            //error = nrfx_pdm_start();
            break;
        case 3:
            err_code = nrfx_pdm_buffer_set(p_buff4, buffer_length);
            flag = 0;
            writeFlag = 1;

            do
            {
                err_code = ble_nus_data_send(&m_nus, buff3, &buffer_length, m_conn_handle);

